layers/+window-management/perspectives/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-11-08 Sun 18:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Perspectives contribution layer for Spacemacs</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css"
                 href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/readtheorg.css" />
</head>
<body>
<div id="content">
<h1 class="title">Perspectives contribution layer for Spacemacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Description</a></li>
<li><a href="#orgheadline3">2. Install</a>
<ul>
<li><a href="#orgheadline2">2.1. Layer</a></li>
</ul>
</li>
<li><a href="#orgheadline13">3. Features</a>
<ul>
<li><a href="#orgheadline6">3.1. Micro-states</a>
<ul>
<li><a href="#orgheadline4">3.1.1. Perspective Management Micro State</a></li>
<li><a href="#orgheadline5">3.1.2. Custom Perspectives Micro State</a></li>
</ul>
</li>
<li><a href="#orgheadline7">3.2. Per project custom perpsective</a></li>
<li><a href="#orgheadline8">3.3. Save/Load perspectives into a file</a></li>
<li><a href="#orgheadline9">3.4. Custom Perspective Macro</a></li>
<li><a href="#orgheadline12">3.5. Predefined custom perspectives</a>
<ul>
<li><a href="#orgheadline10">3.5.1. Org-agenda custom perspective</a></li>
<li><a href="#orgheadline11">3.5.2. RCIRC/ERC custom perspective</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline16">4. Configuration</a>
<ul>
<li><a href="#orgheadline14">4.1. Removing additional help</a></li>
<li><a href="#orgheadline15">4.2. Showing Spacemacs Home Buffer at Startup</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
This contribution layer adds Perspectives to Spacemacs. Perspectives are window
configurations that have buffer isolation between each other (under the keybinding <code>SPC l b</code>).
At the beginning there is a <code>@Home</code> perspective which will contain all buffers by default.
Basically, staying in this perspective will feel as if you didn't have the perspectives layer enabled.
After creating the first perspective via the method you choose (<code>SPC l s</code> or <code>SPC l o custom-poersp</code>
or <code>SPC l P</code> for projectile perspectives). If you kill the <code>@Home</code> perspective <code>SPC l k</code>,
you will also kill every buffer.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">2</span> Install</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> Layer</h3>
<div class="outline-text-3" id="text-2-1">
<p>
To use this contribution add it to your <code>~/.spacemacs</code>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq-default dotspacemacs-configuration-layers '<span class="org-rainbow-delimiters-depth-2">(</span>perspectives<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">3</span> Features</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">3.1</span> Micro-states</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">3.1.1</span> Perspective Management Micro State</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Prefix command for perspective management commands is <code>SPC l</code> (for Layout).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key Binding</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>SPC l ?</code></td>
<td class="org-left">Toggle Documentation of micro-state</td>
</tr>

<tr>
<td class="org-left"><code>SPC l l</code></td>
<td class="org-left">List perspectives</td>
</tr>

<tr>
<td class="org-left"><code>SPC l b</code></td>
<td class="org-left">List buffers in current perspective</td>
</tr>

<tr>
<td class="org-left"><code>SPC l f</code></td>
<td class="org-left">List buffers in current perspective</td>
</tr>

<tr>
<td class="org-left"><code>SPC l K</code></td>
<td class="org-left">Remove buffer from perspective</td>
</tr>

<tr>
<td class="org-left"><code>SPC l i</code></td>
<td class="org-left">import all buffers from other perspective</td>
</tr>

<tr>
<td class="org-left"><code>SPC l t</code></td>
<td class="org-left">display buffer without adding it to perspective</td>
</tr>

<tr>
<td class="org-left"><code>SPC l a</code></td>
<td class="org-left">add buffer to current perspective</td>
</tr>

<tr>
<td class="org-left"><code>SPC l x</code></td>
<td class="org-left">kill current perspective with its buffers</td>
</tr>

<tr>
<td class="org-left"><code>SPC l X</code></td>
<td class="org-left">kill other perspective with its buffers</td>
</tr>

<tr>
<td class="org-left"><code>SPC l c</code></td>
<td class="org-left">close current perspective and keep buffers</td>
</tr>

<tr>
<td class="org-left"><code>SPC l c</code></td>
<td class="org-left">close current perspective and keep buffers</td>
</tr>

<tr>
<td class="org-left"><code>SPC l C</code></td>
<td class="org-left">close other perspective and keep buffers</td>
</tr>

<tr>
<td class="org-left"><code>SPC l i</code></td>
<td class="org-left">Import buffers from other perspective</td>
</tr>

<tr>
<td class="org-left"><code>SPC l o</code></td>
<td class="org-left">open a custom perspective</td>
</tr>

<tr>
<td class="org-left"><code>SPC l n</code></td>
<td class="org-left">switch to next perspective</td>
</tr>

<tr>
<td class="org-left"><code>SPC l N</code> or <code>SPC W p</code></td>
<td class="org-left">switch to previous perspective</td>
</tr>

<tr>
<td class="org-left"><code>SPC l &lt;tab&gt;</code></td>
<td class="org-left">switch to latest perspective</td>
</tr>

<tr>
<td class="org-left"><code>SPC l [1..n..9]</code></td>
<td class="org-left">switch to nth perspective</td>
</tr>

<tr>
<td class="org-left"><code>SPC l r</code></td>
<td class="org-left">rename perspective</td>
</tr>

<tr>
<td class="org-left"><code>SPC l w</code></td>
<td class="org-left">Save perspectives to file</td>
</tr>

<tr>
<td class="org-left"><code>SPC l L</code></td>
<td class="org-left">Load perspectives from file</td>
</tr>

<tr>
<td class="org-left"><code>SPC l s</code></td>
<td class="org-left">switch perspective</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">3.1.2</span> Custom Perspectives Micro State</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
The default bindings are the following:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key Binding</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>SPC l o e</code></td>
<td class="org-left">Emacs custom perspective</td>
</tr>

<tr>
<td class="org-left"><code>SPC l o E</code></td>
<td class="org-left">ERC custom perspective (needs the erc layer enabled)</td>
</tr>

<tr>
<td class="org-left"><code>SPC l o i</code></td>
<td class="org-left">RCIRC custom perspective (needs the rcirc layer enabled)</td>
</tr>

<tr>
<td class="org-left"><code>SPC l o o</code></td>
<td class="org-left">Org custom perspective</td>
</tr>
</tbody>
</table>

<p>
You can of course add more custom perspectives by using the
<code>spacemacs|define-custom-perspective</code> macro explained further below.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">3.2</span> Per project custom perpsective</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Projectile will work normally in any perspectives by adding buffers to the current
perspective, but if you want to create a perspective specific to some project you
can use the <code>SPC l P</code>.
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">3.3</span> Save/Load perspectives into a file</h3>
<div class="outline-text-3" id="text-3-3">
<p>
With <code>SPC l w</code> and <code>SPC l L</code> you can save and load perspectives to a file this
is done without configuration, support is great for emacs 24.4, but depends on
<code>workgroups.el</code> for Emacs &lt;= 24.3.
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">3.4</span> Custom Perspective Macro</h3>
<div class="outline-text-3" id="text-3-4">
<p>
If you want to add a new custom-persp (for example if you want to have
IRC on its own perspective or maybe calendar or gnus) you have to use
the macro <code>spacemacs|define-custom-persp</code> as follows:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>spacemacs|define-custom-persp <span class="org-string">"&lt;name-to-be-shown-in-the-modeline&gt;"</span>
  <span class="org-builtin">:binding</span> <span class="org-string">"&lt;bind-key&gt;"</span>
  <span class="org-builtin">:body</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>...<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>stuff to be done in the persp activating<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>a major mode like twittering-mode or whatever<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>...<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
You can check out the layer's packages.el to see some examples of the
custom-perspectives. if you define something like this you may be able
to define a perspective with a layout.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>spacemacs|define-custom-persp <span class="org-string">"c++"</span>
  <span class="org-builtin">:binding</span> <span class="org-string">"+"</span>
  <span class="org-builtin">:body</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>find-file <span class="org-string">"~/path/to/first/file.cpp"</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>split-window-right<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>find-file <span class="org-string">"~/path/to/second/file.cpp"</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>... do more stuff but be careful not to destroy the universe ...<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Then you can access this persp with <code>SPC l o +</code>, where <code>+</code> is the binding.
</p>
</div>
</div>


<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">3.5</span> Predefined custom perspectives</h3>
<div class="outline-text-3" id="text-3-5">
</div><div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">3.5.1</span> Org-agenda custom perspective</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
Here we define a custom perspective that adds items to your org-agenda. If you
do not know what that is check the <a href="https://www.gnu.org/software/emacs/manual/html_node/org/Agenda-commands.html">docs</a>.
</p>

<p>
The cool part is that you can have many org files with todos in the agenda and
with one simple command you can gather all the todos from all the agenda files
you have and show them in a single buffer. (in evil the command starts with <code>;a</code>)
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">3.5.2</span> RCIRC/ERC custom perspective</h4>
<div class="outline-text-4" id="text-3-5-2">
<p>
Now you can also open IRC in a new perspective to keep all the chat buffers in
one perspective isolated from your work buffers.
</p>

<p>
You will have to use the perspective layer as well as the rcirc/erc layer:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq-default dotspacemacs-configuration-layers '<span class="org-rainbow-delimiters-depth-2">(</span>rcirc
                                                  erc
                                                  <span class="org-comment-delimiter">;; </span><span class="org-comment">you only need one of those layers</span>
                                                  perspectives<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">4</span> Configuration</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">4.1</span> Removing additional help</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Once you know the key bindings to navigate between the workspaces you
may want to disable the exhaustive help in the workspace micro-state.
Set the variable <code>perspective-display-help</code> to <code>nil</code>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq-default dotspacemacs-configuration-layers
  '<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span>perspectives <span class="org-builtin">:variables</span> perspective-display-help nil<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">4.2</span> Showing Spacemacs Home Buffer at Startup</h3>
<div class="outline-text-3" id="text-4-2">
<p>
If you changed stuff in your <code>@Home</code> perspectives, the state won't be reloaded 
each time you restart Emacs, each time the Home buffer will be shown. If you don't want
 to see the home buffer at startup change the value of <code>spacemacs-persp-show-home-at-startup</code>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-11-08 Sun 18:48</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
